app/controllers/apis_controller.rb

  def calculated

    count = 0
    nowtime = DateTime.new(2013, 10, 1, 00, 00)
    @counts = Hash.new()
    datasets = Array.new()
    Item.all.each do|item|
---
SELECT "items".* FROM "items"