app/controllers/roots_controller.rb

SELECT "items".* FROM "items"
---
  def all
    @items = Item.all